performance/artillery.yml
# Artillery.js Performance Testing Configuration
config:
  target: 'http://localhost:3001'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    # Cool down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool down"
  
  # Performance thresholds
  ensure:
    p95: 200  # 95% of requests should complete within 200ms
    p99: 500  # 99% of requests should complete within 500ms
    maxErrorRate: 1  # Maximum 1% error rate
  
  # Request configuration
  http:
    timeout: 10
    pool: 10

  # Custom variables
  variables:
    testProductId: "test-product-id"
    testCustomerId: "test-customer-id"

# Test scenarios
scenarios:
  # Homepage load test
  - name: "Homepage Performance"
    weight: 30
    flow:
      - get:
          url: "/api/health"
          capture:
            - json: "$.status"
              as: "health_status"
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
            - contentType: json
          capture:
            - json: "$.products[0].id"
              as: "productId"

  # Product catalog performance
  - name: "Product Catalog"
    weight: 25
    flow:
      - get:
          url: "/api/products"
          qs:
            page: 1
            limit: 20
          expect:
            - statusCode: 200
            - hasProperty: "products"
      - get:
          url: "/api/products/{{ productId }}"
          expect:
            - statusCode: 200
            - hasProperty: "id"

  # Search performance
  - name: "Search Functionality"
    weight: 20
    flow:
      - get:
          url: "/api/products"
          qs:
            search: "anillo"
            category: "Anillos"
          expect:
            - statusCode: 200
      - get:
          url: "/api/products"
          qs:
            search: "oro"
            priceMin: 100
            priceMax: 500
          expect:
            - statusCode: 200

  # Admin operations
  - name: "Admin Operations"
    weight: 15
    flow:
      # Simulate admin login (would need actual auth in real scenario)
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "TestAdmin123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/admin/stats/overview"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401, 403]  # May not be authorized in test

  # Customer operations
  - name: "Customer Journey"
    weight: 10
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "perf-test-{{ $randomNumber }}@test.com"
            password: "TestUser123!"
            name: "Performance Test User"
            role: "CUSTOMER"
          expect:
            - statusCode: [201, 400, 409]  # May already exist
          capture:
            - json: "$.token"
              as: "customerToken"
      - get:
          url: "/api/customers/profile"
          headers:
            Authorization: "Bearer {{ customerToken }}"
          expect:
            - statusCode: [200, 401]

# Before/After hooks
before:
  flow:
    - log: "Starting performance test suite..."

after:
  flow:
    - log: "Performance test completed!"

# Reporting
plugins:
  # Metrics by endpoint
  metrics-by-endpoint:
    useOnlyRequestNames: true
  
  # Publish metrics to CloudWatch (optional)
  # cloudwatch:
  #   namespace: "OliviaGold/Performance"

# Custom functions (if needed)
# processor: "./performance/processors.js"